{ "translations": {
    "Error during OAuth exchanges" : "Грешка по време на обмен на OAuth",
    "Error getting OAuth access token" : "Грешка при получаване на маркер за достъп до OAuth",
    "Reddit news" : "Reddit новини",
    "Bad HTTP method" : "Лош HTTP метод",
    "Bad credentials" : "Лоши идентификационни данни",
    "Token is not valid anymore. Impossible to refresh it." : "Маркерът вече не е валиден. Не е възможно да го обновите.",
    "OAuth access token refused" : " Маркерът за достъп OAuth е отказан",
    "Connected accounts" : "Свързани профили",
    "Reddit integration" : "Reddit интеграция",
    "Integration of Reddit social news aggregation service" : "Интегриране на Reddit услугата за събиране на социални новини",
    "Reddit integration provides a dashboard widget displaying your recent subscribed news." : "Интеграцията на Reddit предоставя изпълним модул за табло, показващ скорошни новини, за които сте абониран.",
    "There are 3 ways to allow your Nextcloud users to use OAuth to authenticate to Reddit:" : "Има 3 начина да позволите на потребителите на Nextcloud да използват OAuth за удостоверяване на Reddit:",
    "Leave all fields empty to use default Nextcloud Reddit OAuth app." : "Оставете всички полета празни, за да използвате приложението Nextcloud Reddit OAuth по подразбиране.",
    "Create your own Reddit \"web application\" in Reddit preferences and put the application ID and secret below." : "Създайте свое собствено „уеб приложение“ на Reddit в предпочитанията на Reddit и поставете идентификатора на приложението и тайната по-долу.",
    "Reddit app settings" : "Настройки на приложението Reddit ",
    "Make sure you set the \"Redirection URI\" to" : "Уверете се, че сте задали „URI за пренасочване“ на",
    "Create your own Reddit \"mobile application\" in Reddit preferences and put the application ID below. Leave the \"Application secret\" field empty." : "Създайте свое собствено „мобилно приложение“ на Reddit в предпочитанията на Reddit и поставете идентификатора на приложението по-долу. Оставете полето „Тайна на приложение“ празно.",
    "Application ID" : "Идентификатор на приложение",
    "Client ID of your Reddit application" : "Клиентски идентификатор на вашето Reddit приложение",
    "Application secret" : "Тайна на приложение",
    "Client secret of your Reddit application" : "Клиентска тайна на вашето Reddit приложение",
    "Reddit admin options saved" : "Опциите за администратор на Reddit са записани",
    "Failed to save Reddit admin options" : "Неуспешно записване на опциите за администратор на Reddit",
    "If you have trouble authenticating, ask your Nextcloud administrator to check Reddit admin settings." : "Ако имате проблеми с удостоверяването, помолете вашия администратор на Nextcloud да провери настройките за администратор на Reddit.",
    "Make sure to accept the protocol registration on top of this page to allow authentication to Reddit." : "Уверете се, че сте приели регистрацията на протокола в горната част на тази страница, за да разрешите удостоверяване на Reddit.",
    "With Chrome/Chromium, you should see a popup on browser top-left to authorize this page to open \"web+nextcloudreddit\" links." : "С Chrome/Chromium, трябва да видите изскачащ прозорец в браузъра горе вляво, за да упълномощите тази страница да отваря връзки „web+nextcloudreddit“.",
    "If you don't see the popup, you can still click on this icon in the address bar." : "Ако не виждате изскачащия прозорец, все пак можете да кликнете върху тази икона в адресната лента.",
    "Then authorize this page to open \"web+nextcloudreddit\" links." : "След това упълномощете тази страница да отваря „web+nextcloudreddit“ връзки.",
    "If you still don't manage to get the protocol registered, check your settings on this page:" : "Ако все още не успявате да регистрирате протокола, проверете настройките си на тази страница:",
    "With Firefox, you should see a bar on top of this page to authorize this page to open \"web+nextcloudreddit\" links." : "С Firefox трябва да видите лента в горната част на тази страница, за да упълномощите страницата да отваря „web+nextcloudreddit“ връзки.",
    "Connect to Reddit" : "Свързване с Reddit ",
    "Connected as {user}" : "Свързване като {user}",
    "Disconnect from Reddit" : "Прекъсване на връзката с Reddit",
    "You must access this page with HTTPS to be able to authenticate to Reddit." : "Трябва да получите достъп до тази страница с HTTPS, за да е възможно  удостоверяване в Reddit.",
    "Successfully connected to Reddit!" : "Успешно свързване с Reddit!",
    "Reddit OAuth error:" : "Грешка в Reddit OAuth:",
    "Nextcloud Reddit integration on {ncUrl}" : "Интегриране на Nextcloud Reddit на {ncUrl}",
    "Reddit options saved" : "Опциите на Reddit са записани",
    "Failed to save Reddit options" : "Неуспешно записване на опциите на Reddit",
    "Failed to save Reddit OAuth state" : "Неуспешно записване на състоянието на Reddit OAuth",
    "No Reddit account connected" : "Няма свързан профил в Reddit",
    "Error connecting to Reddit" : "Грешка при свързване с Reddit",
    "No Reddit news!" : "Няма Reddit новини",
    "Failed to get Reddit news" : "Неуспешно получаване на новини от Reddit"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}