{ "translations": {
    "Error during OAuth exchanges" : "Σφάλμα κατά την ανταλλαγή OAuth",
    "Error getting OAuth access token" : "Σφάλμα κατά τη λήψη διακριτικού πρόσβασης OAuth",
    "Reddit news" : "Νέα Reddit",
    "Bad credentials" : "Εσφαλμένα διαπιστευτήρια",
    "Token is not valid anymore. Impossible to refresh it." : "Το κουπόνι δεν είναι πλέον έγκυρο. Αδύνατο να το ανανεώσετε.",
    "OAuth access token refused" : "Το διακριτικό πρόσβασης OAuth απορρίφθηκε",
    "Connected accounts" : "Συνδεδεμένοι λογαριασμοί",
    "Reddit integration" : "Ενσωμάτωση Reddit",
    "Integration of Reddit social news aggregation service" : "Ενσωμάτωση της υπηρεσίας συγκέντρωσης ειδήσεων Reddit",
    "Reddit integration provides a dashboard widget displaying your recent subscribed news." : "Η ενσωμάτωση Reddit παρέχει ένα widget πίνακα ελέγχου που εμφανίζει τα πρόσφατα εγγεγραμμένα νέα σας.",
    "There are 3 ways to allow your Nextcloud users to use OAuth to authenticate to Reddit:" : "Υπάρχουν 3 τρόποι για να επιτρέψετε στους χρήστες σας του Nextcloud να χρησιμοποιούν το OAuth για έλεγχο ταυτότητας στο Reddit:",
    "Leave all fields empty to use default Nextcloud Reddit OAuth app." : "Αφήστε όλα τα πεδία κενά για να χρησιμοποιήσετε την προεπιλεγμένη εφαρμογή Nextcloud Reddit OAuth.",
    "Create your own Reddit \"web application\" in Reddit preferences and put the application ID and secret below." : "Δημιουργήστε τη δική σας \"εφαρμογή Ιστότοπου\" Reddit στις προτιμήσεις Reddit και τοποθετήστε το αναγνωριστικό και το μυστικό της εφαρμογής παρακάτω.",
    "Reddit app settings" : "Ρυθμίσεις εφαρμογής Reddit",
    "Make sure you set the \"Redirection uri\" to" : "Βεβαιωθείτε ότι έχετε ορίσει το \"Redirection uri\" σε",
    "Create your own Reddit \"mobile application\" in Reddit preferences and put the application ID below. Leave the \"Application secret\" field empty." : "Δημιουργήστε τη δική σας \"εφαρμογή για κινητά\" Reddit στις προτιμήσεις Reddit και τοποθετήστε το αναγνωριστικό εφαρμογής παρακάτω. Αφήστε το πεδίο \"Μυστικό εφαρμογής\" κενό.",
    "Application ID" : "Αναγνωριστικό εφαρμογής",
    "Client ID of your Reddit application" : "Αναγνωριστικό πελάτη της εφαρμογής Reddit",
    "Application secret" : "Μυστικό εφαρμογής",
    "Client secret of your Reddit application" : "Μυστικό πελάτη της εφαρμογής Reddit",
    "Reddit admin options saved" : "Οι επιλογές του διαχειριστή Reddit αποθηκεύτηκαν",
    "Failed to save Reddit admin options" : "Αποτυχία αποθήκευσης των επιλογών διαχειριστή Reddit",
    "If you have trouble authenticating, ask your Nextcloud administrator to check Reddit admin settings." : "Εάν αντιμετωπίζετε προβλήματα με τον έλεγχο ταυτότητας, ζητήστε από τον διαχειριστή σας του Nextcloud να ελέγξει τις ρυθμίσεις διαχειριστή Reddit.",
    "Make sure to accept the protocol registration on top of this page to allow authentication to Reddit." : "Βεβαιωθείτε ότι αποδέχεστε την εγγραφή πρωτοκόλλου στην κορυφή αυτής της σελίδας για να επιτρέψετε τον έλεγχο ταυτότητας στο Reddit.",
    "With Chrome/Chromium, you should see a popup on browser top-left to authorize this page to open \"web+nextcloudreddit\" links." : "Με το Chrome / Chromium, θα πρέπει να δείτε ένα αναδυόμενο παράθυρο στο πρόγραμμα περιήγησης επάνω αριστερά για να εξουσιοδοτήσετε αυτήν τη σελίδα να ανοίξει συνδέσμους \"web + nextcloudreddit\".",
    "If you don't see the popup, you can still click on this icon in the address bar." : "Εάν δεν βλέπετε το αναδυόμενο παράθυρο, μπορείτε ακόμα να κάνετε κλικ σε αυτό το εικονίδιο στη γραμμή διευθύνσεων.",
    "Then authorize this page to open \"web+nextcloudreddit\" links." : "Στη συνέχεια, εξουσιοδοτήστε αυτήν τη σελίδα για να ανοίξετε συνδέσμους \"web + nextcloudreddit\".",
    "If you still don't manage to get the protocol registered, check your settings on this page:" : "Εάν εξακολουθείτε να μην εγγράψατε το πρωτόκολλο, ελέγξτε τις ρυθμίσεις σας σε αυτήν τη σελίδα:",
    "With Firefox, you should see a bar on top of this page to authorize this page to open \"web+nextcloudreddit\" links." : "Με τον Firefox, θα πρέπει να δείτε μια γραμμή στην κορυφή αυτής της σελίδας για να επιτρέψετε σε αυτήν τη σελίδα να ανοίξει συνδέσμους \"web + nextcloudreddit\".",
    "Connect to Reddit" : "Σύνδεση στο Reddit",
    "Connected as {user}" : "Συνδεδεμένος ως {user}",
    "Disconnect from Reddit" : "Αποσύνδεση από το Reddit",
    "You must access this page with HTTPS to be able to authenticate to Reddit." : "Πρέπει να αποκτήσετε πρόσβαση σε αυτήν τη σελίδα με HTTPS για να μπορείτε να πιστοποιηθείτε στο Reddit.",
    "Successfully connected to Reddit!" : "Επιτυχημένη σύνδεση στο Reddit!",
    "Reddit OAuth error:" : "Σφάλμα Reddit OAuth:",
    "Nextcloud Reddit integration on {ncUrl}" : "Ενσωμάτωση Reddit Nextcloud στο {ncUrl}",
    "Reddit options saved" : "Οι επιλογές του Reddit αποθηκεύτηκαν",
    "Failed to save Reddit options" : "Αποτυχία αποθήκευσης των επιλογών Reddit",
    "Failed to save Reddit OAuth state" : "Αποτυχία αποθήκευσης της κατάστασης του Reddit OAuth",
    "No Reddit account connected" : "Κανένας συνδεδεμένος λογαριασμός Reddit",
    "Error connecting to Reddit" : "Σφάλμα σύνδεσης στο Reddit",
    "No Reddit news!" : "Κανένα νέο Reddit!",
    "Failed to get Reddit news" : "Αποτυχία λήψης νέων Reddit"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}