{ "translations": {
    "Error during OAuth exchanges" : "Error durante los intercambios de OAuth",
    "Error getting OAuth access token" : "Error al obtener el token de acceso de OAuth",
    "Reddit news" : "Noticias de Reddit",
    "Comment from %1$s in %2$s" : "Comentario de %1$s en %2$s",
    "Reddit publications and subreddits" : "Publicaciones y subreddits de Reddit",
    "By @%1$s in %2$s" : "Por @%1$s en %2$s",
    "Reddit posts" : "Publicaciones de Reddit",
    "Subreddits" : "Subreddits",
    "Bad HTTP method" : "Método HTTP incorrecto",
    "Bad credentials" : "Credenciales incorrectas",
    "Failed to get Reddit news" : "Error al obtener las noticias de Reddit",
    "OAuth access token refused" : "Se rechazó el token de acceso de OAuth",
    "Connected accounts" : "Cuentas conectadas",
    "Reddit integration" : "Integración de Reddit",
    "Integration of Reddit social news aggregation service" : "Integración del servicio de agregación de noticias sociales de Reddit",
    "Reddit integration provides a dashboard widget displaying your recent subscribed news." : "La integración de Reddit proporciona un widget de tablero que muestra tus noticias suscritas recientes.",
    "Reddit admin options saved" : "Opciones de administrador de Reddit guardadas",
    "Failed to save Reddit admin options" : "Error al guardar las opciones de administrador de Reddit",
    "There are 3 ways to allow your Nextcloud users to use OAuth to authenticate to Reddit:" : "Hay 3 formas de permitir que tus usuarios de Nextcloud utilicen OAuth para autenticarse en Reddit:",
    "Leave all fields empty to use default Nextcloud Reddit OAuth app." : "Dejar todos los campos vacíos para usar la aplicación predeterminada de OAuth de Reddit de Nextcloud.",
    "Create your own Reddit \"web application\" in Reddit preferences and put the application ID and secret below." : "Crear tu propia \"aplicación web\" de Reddit en las preferencias de Reddit y colocar el ID de la aplicación y el secreto a continuación.",
    "Reddit app settings" : "Configuraciones de la aplicación Reddit",
    "Make sure you set the \"Redirection URI\" to" : "Asegúrate de establecer la \"URL de redireccionamiento\" en",
    "Create your own Reddit \"mobile application\" in Reddit preferences and put the application ID below. Leave the \"Application secret\" field empty." : "Crear tu propia \"aplicación móvil\" de Reddit en las preferencias de Reddit y colocar el ID de la aplicación a continuación. Dejar el campo de \"Secreto de la aplicación\" vacío.",
    "Application ID" : "ID de la aplicación",
    "Client ID of your Reddit application" : "ID de cliente de tu aplicación de Reddit",
    "Application secret" : "Secreto de la aplicación",
    "Client secret of your Reddit application" : "Secreto de cliente de tu aplicación de Reddit",
    "Successfully connected to Reddit!" : "¡Conexión a Reddit exitosa!",
    "Reddit OAuth error:" : "Error de autenticación de Reddit:",
    "Nextcloud Reddit integration on {ncUrl}" : "Integración de Reddit de Nextcloud en {ncUrl}",
    "Reddit options saved" : "Opciones de Reddit guardadas",
    "Failed to save Reddit options" : "Error al guardar las opciones de Reddit",
    "Failed to save Reddit OAuth state" : "Error al guardar el estado de autenticación de Reddit",
    "If you have trouble authenticating, ask your Nextcloud administrator to check Reddit admin settings." : "Si tienes problemas de autenticación, pide a tu administrador de Nextcloud que verifique las configuraciones de administrador de Reddit.",
    "Make sure to accept the protocol registration on top of this page to allow authentication to Reddit." : "Asegúrate de aceptar el registro del protocolo en la parte superior de esta página para permitir la autenticación en Reddit.",
    "With Chrome/Chromium, you should see a popup on browser top-left to authorize this page to open \"web+nextcloudreddit\" links." : "Con Chrome/Chromium, deberías ver un aviso emergente en la parte superior izquierda del navegador para autorizar esta página a abrir enlaces \"web+nextcloudreddit\".",
    "If you don't see the popup, you can still click on this icon in the address bar." : "Si no ves el mensaje emergente, aún puedes hacer clic en este icono en la barra de direcciones.",
    "Then authorize this page to open \"web+nextcloudreddit\" links." : "Luego autoriza esta página a abrir enlaces \"web+nextcloudreddit\".",
    "If you still don't manage to get the protocol registered, check your settings on this page:" : "Si aún no logras registrar el protocolo, verifica tu configuración en esta página:",
    "With Firefox, you should see a bar on top of this page to authorize this page to open \"web+nextcloudreddit\" links." : "Con Firefox, deberías ver una barra en la parte superior de esta página para autorizar esta página a abrir enlaces \"web+nextcloudreddit\".",
    "Connect to Reddit" : "Conectar con Reddit",
    "Connected as {user}" : "Conectado como {usuario}",
    "Disconnect from Reddit" : "Desconectar de Reddit",
    "You must access this page with HTTPS to be able to authenticate to Reddit." : "Debes acceder a esta página con HTTPS para poder autenticarte en Reddit.",
    "No Reddit account connected" : "No hay cuenta de Reddit conectada",
    "Error connecting to Reddit" : "Error al conectar con Reddit",
    "No Reddit news!" : "¡No hay noticias de Reddit!"
},"pluralForm" :"nplurals=3; plural=n == 1 ? 0 : n != 0 && n % 1000000 == 0 ? 1 : 2;"
}