{ "translations": {
    "Error during OAuth exchanges" : "Earráid le linn malartuithe OAuth",
    "Error getting OAuth access token" : "Earráid agus comhartha rochtana OAuth á fháil",
    "Reddit news" : "Nuacht Reddit",
    "Comment from %1$s in %2$s" : "Nóta tráchta ó %1$s i %2$s",
    "Reddit publications and subreddits" : "foilseacháin Reddit agus subreddits",
    "By @%1$s in %2$s" : "Le @%1$s i %2$s",
    "Reddit posts" : "Postálacha Reddit",
    "Subreddits" : "Subreddits",
    "Bad HTTP method" : "Droch-mhodh HTTP",
    "Bad credentials" : "Dintiúir dona",
    "Failed to get Reddit news" : "Theip ar nuacht Reddit a fháil",
    "OAuth access token refused" : "Diúltaíodh comhartha rochtana OAuth",
    "Connected accounts" : "Cuntais nasctha",
    "Reddit integration" : "Comhtháthú Reddit",
    "Integration of Reddit social news aggregation service" : "Comhtháthú na seirbhíse comhiomlánaithe nuachta sóisialta Reddit",
    "Reddit integration provides a dashboard widget displaying your recent subscribed news." : "Soláthraíonn comhtháthú Reddit giuirléid deais a thaispeánann do nuacht suibscríofa le déanaí.",
    "Reddit admin options saved" : "Roghanna riaracháin Reddit sábháilte",
    "Failed to save Reddit admin options" : "Theip ar shábháil roghanna riaracháin Reddit",
    "There are 3 ways to allow your Nextcloud users to use OAuth to authenticate to Reddit:" : "Tá 3 bhealach ann chun ligean do d’úsáideoirí Nextcloud OAuth a úsáid chun Reddit a fhíordheimhniú:",
    "Leave all fields empty to use default Nextcloud Reddit OAuth app." : "Fág gach réimse folamh chun an aip réamhshocraithe Nextcloud Reddit OAuth a úsáid.",
    "Create your own Reddit \"web application\" in Reddit preferences and put the application ID and secret below." : "Cruthaigh d'iarratas gréasáin Reddit féin i roghanna Reddit agus cuir ID agus rún an fheidhmchláir thíos.",
    "Reddit app settings" : "Socruithe aip Reddit",
    "Make sure you set the \"Redirection URI\" to" : "Bí cinnte go socraíonn tú an \"URI Atreoraithe\" go",
    "Create your own Reddit \"mobile application\" in Reddit preferences and put the application ID below. Leave the \"Application secret\" field empty." : "Cruthaigh d'iarratas soghluaiste Reddit féin i roghanna Reddit agus cuir ID an fheidhmchláir thíos. Fág an réimse \"Rúnda an iarratais\" folamh.",
    "Application ID" : "ID Feidhmchláir",
    "Client ID of your Reddit application" : "ID Cliant d'fheidhmchlár Reddit",
    "Application secret" : "Rún iarratais",
    "Client secret of your Reddit application" : "Rún cliant d'fheidhmchlár Reddit",
    "Successfully connected to Reddit!" : "Ceangailte go rathúil le Reddit!",
    "Reddit OAuth error:" : "Earráid Reddit OAuth:",
    "Nextcloud Reddit integration on {ncUrl}" : "Comhtháthú Nextcloud Reddit ar {ncUrl}",
    "Reddit options saved" : "Roghanna Reddit sábháilte",
    "Failed to save Reddit options" : "Theip ar shábháil roghanna Reddit",
    "Failed to save Reddit OAuth state" : "Theip ar shábháil Reddit OAuth state",
    "If you have trouble authenticating, ask your Nextcloud administrator to check Reddit admin settings." : "Má tá trioblóid agat le fíordheimhniú, iarr ar do riarthóir Nextcloud socruithe riaracháin Reddit a sheiceáil.",
    "Make sure to accept the protocol registration on top of this page to allow authentication to Reddit." : "Bí cinnte go nglacann tú leis an gclárú prótacail ar bharr an leathanaigh seo chun fíordheimhniú a cheadú do Reddit.",
    "With Chrome/Chromium, you should see a popup on browser top-left to authorize this page to open \"web+nextcloudreddit\" links." : "Le Chrome/Chromium, ba cheart duit preabfhuinneog a fheiceáil ar an mbrabhsálaí barr ar chlé chun an leathanach seo a údarú chun naisc “web+nextcloudreddit” a oscailt.",
    "If you don't see the popup, you can still click on this icon in the address bar." : "Mura bhfeiceann tú an phreabfhuinneog, is féidir leat cliceáil fós ar an deilbhín seo sa bharra seoltaí.",
    "Then authorize this page to open \"web+nextcloudreddit\" links." : "Ansin ceadaigh an leathanach seo chun naisc \"web+nextcloudreddit\" a oscailt.",
    "If you still don't manage to get the protocol registered, check your settings on this page:" : "Mura n-éiríonn leat an prótacal a chlárú go fóill, seiceáil do shocruithe ar an leathanach seo:",
    "With Firefox, you should see a bar on top of this page to authorize this page to open \"web+nextcloudreddit\" links." : "Le Firefox, ba cheart duit barra a fheiceáil ar bharr an leathanaigh seo chun an leathanach seo a údarú chun naisc “web+nextcloudreddit” a oscailt.",
    "Connect to Reddit" : "Ceangail le Reddit",
    "Connected as {user}" : "Ceangailte mar {user}",
    "Disconnect from Reddit" : "Dícheangail ó Reddit",
    "You must access this page with HTTPS to be able to authenticate to Reddit." : "Ní mór duit rochtain a fháil ar an leathanach seo le HTTPS chun a bheith in ann a fhíordheimhniú go Reddit.",
    "No Reddit account connected" : "Níl aon chuntas Reddit ceangailte",
    "Error connecting to Reddit" : "Earráid ag nascadh le Reddit",
    "No Reddit news!" : "Sin nuacht Reddit!"
},"pluralForm" :"nplurals=5; plural=(n==1 ? 0 : n==2 ? 1 : n<7 ? 2 : n<11 ? 3 : 4);"
}