{ "translations": {
    "Error during OAuth exchanges" : "Produciuse un erro durante os intercambios de OAuth",
    "Error getting OAuth access token" : "Produciuse un erro ao obter o testemuño de acceso OAuth",
    "Reddit news" : "Novas de Reddit",
    "Bad HTTP method" : "Método HTTP incorrecto",
    "Bad credentials" : "Credenciais incorrectas",
    "Failed to get Reddit news" : "Produciuse un fallo ao obter as novas de Reddit",
    "OAuth access token refused" : "Foi rexeitado o testemuño de acceso de OAuth",
    "Connected accounts" : "Contas conectadas",
    "Reddit integration" : "Integración de Reddit",
    "Integration of Reddit social news aggregation service" : "Integración do servizo de agregación de novas sociais de Reddit",
    "Reddit integration provides a dashboard widget displaying your recent subscribed news." : "A integración de Reddit fornece un trebello de taboleiro que amosa as súas novas subscritas recentes.",
    "There are 3 ways to allow your Nextcloud users to use OAuth to authenticate to Reddit:" : "Hai 3 xeitos de permitir que os usuarios de Nextcloud usen OAuth para autenticarse no Reddit:",
    "Leave all fields empty to use default Nextcloud Reddit OAuth app." : "Deixe todos os campos baleiros para usar a aplicación Nextcloud Reddit OAuth predeterminada.",
    "Create your own Reddit \"web application\" in Reddit preferences and put the application ID and secret below." : "Cree a súa propia «aplicación web» de Reddit nas preferencias de Reddit e poña o ID da aplicación a seguir.",
    "Reddit app settings" : "Axustes da aplicación Reddit",
    "Create your own Reddit \"mobile application\" in Reddit preferences and put the application ID below. Leave the \"Application secret\" field empty." : "Cree a súa propia «aplicación móbil» de Reddit nas preferencias de Reddit e poña o ID da aplicación a seguir. Deixe o campo «Segredo da aplicación» baleiro.",
    "Application ID" : "ID da aplicación",
    "Client ID of your Reddit application" : "ID de cliente da súa aplicación de Reddit",
    "Application secret" : "Segredo da aplicación",
    "Client secret of your Reddit application" : "Segredo do cliente da súa aplicación de Reddit",
    "Reddit admin options saved" : "Gardáronse as opcións de administración de Reddit",
    "Failed to save Reddit admin options" : "Produciuse un fallo ao gardar as opcións de administración de Reddit.",
    "If you have trouble authenticating, ask your Nextcloud administrator to check Reddit admin settings." : "Se ten problemas na autenticación, pídalle á administración de Nextcloud que verifique os axustes de administración de Reddit.",
    "Make sure to accept the protocol registration on top of this page to allow authentication to Reddit." : "Asegúrese de aceptar o rexistro do protocolo na parte superior desta páxina para permitir a autenticación no Reddit.",
    "With Chrome/Chromium, you should see a popup on browser top-left to authorize this page to open \"web+nextcloudreddit\" links." : "Con Chrome/Chromium, debería ver unha xanela emerxente na parte superior esquerda do navegador para autorizar a esta páxina a abrir ligazóns «web+nextcloudreddit».",
    "If you don't see the popup, you can still click on this icon in the address bar." : "Se non ve  a xanela emerxente, aínda pode premer nesta icona na barra de enderezos.",
    "Then authorize this page to open \"web+nextcloudreddit\" links." : "Entón autorizar a esta páxina a abrir as ligazóns «web+nextcloudreddit».",
    "If you still don't manage to get the protocol registered, check your settings on this page:" : "Se aínda non conseguiu rexistrar o protocolo, comprobe os seus axustes nesta páxina:",
    "With Firefox, you should see a bar on top of this page to authorize this page to open \"web+nextcloudreddit\" links." : "Con Firefox, debería ver unha barra na parte superior desta páxina para autorizar a esta páxina a abrir ligazóns «web+nextcloudreddit».",
    "Connect to Reddit" : "Conectar con Reddit",
    "Connected as {user}" : "Conectado como {user}",
    "Disconnect from Reddit" : "Desconectar de Reddit",
    "You must access this page with HTTPS to be able to authenticate to Reddit." : "Debe acceder a esta páxina con HTTPS para poder autenticarse no Reddit.",
    "Successfully connected to Reddit!" : "Conectou satisfactoriamente con Reddit!",
    "Reddit OAuth error:" : "Erro do OAuth de Reddit:",
    "Nextcloud Reddit integration on {ncUrl}" : "Integración do Reddit de Nextcloud en {ncUrl}",
    "Reddit options saved" : "Gardáronse as opcións de Reddit",
    "Failed to save Reddit options" : "Produciuse un fallo ao gardar as opcións de Reddit.",
    "Failed to save Reddit OAuth state" : "Produciuse un fallo ao gardar o estado do OAuth de Reddit",
    "No Reddit account connected" : "Non hai ningunha conta de Reddit conectada",
    "Error connecting to Reddit" : "Produciuse un erro ao conectar con Reddit",
    "No Reddit news!" : "Non hai novas de Reddit."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}