{ "translations": {
    "Error during OAuth exchanges" : "Pogreška tijekom razmjene radi autentifikacije OAuth",
    "Error getting OAuth access token" : "Pogreška pri dohvaćanju tokena za pristup OAuth",
    "Reddit news" : "Reddit vijesti",
    "Bad HTTP method" : "Pogrešna metoda HTTP-a",
    "Bad credentials" : "Pogrešne vjerodajnice",
    "OAuth access token refused" : "Odbijen token za pristup OAuth",
    "Connected accounts" : "Povezani računi",
    "Reddit integration" : "Reddit integracija",
    "Integration of Reddit social news aggregation service" : "Integracija servisa za društvenu agregaciju vijesti Reddit",
    "Reddit integration provides a dashboard widget displaying your recent subscribed news." : "Reddit integracija omogućuje postavljanje widgeta na nadzornu ploču koji prikazuje najnovije vijesti na koje ste pretplaćeni.",
    "There are 3 ways to allow your Nextcloud users to use OAuth to authenticate to Reddit:" : "Postoje 3 načina kojim možete svojim korisnicima Nextclouda omogućiti autentifikaciju na Reddit putem aplikacije OAuth:",
    "Leave all fields empty to use default Nextcloud Reddit OAuth app." : "Ostavite sva polja prazna kako biste se koristili zadanom aplikacijom Nextcloud Reddit OAuth.",
    "Create your own Reddit \"web application\" in Reddit preferences and put the application ID and secret below." : "Stvorite vlastitu „web aplikaciju“ za Reddit u postavkama Reddita i unesite ID aplikacije i tajni ključ u nastavku.",
    "Reddit app settings" : "Postavke aplikacije Reddit",
    "Make sure you set the \"Redirection URI\" to" : "Obavezno postavite „URI za preusmjeravanje“ na",
    "Create your own Reddit \"mobile application\" in Reddit preferences and put the application ID below. Leave the \"Application secret\" field empty." : "Stvorite vlastitu „mobilnu aplikaciju“ za Reddit u postavkama Reddita i unesite ID aplikacije u nastavku. Ostavite polje „Tajni ključ aplikacije“ prazno.",
    "Application ID" : "ID aplikacije",
    "Client ID of your Reddit application" : "ID klijenta vaše aplikacije Reddit",
    "Application secret" : "Tajni ključ aplikacije",
    "Client secret of your Reddit application" : "Tajni ključ klijenta vaše aplikacije Reddit",
    "Reddit admin options saved" : "Administratorske postavke Reddita su spremljene",
    "Failed to save Reddit admin options" : "Spremanje administratorskih postavki Reddita nije uspjelo",
    "If you have trouble authenticating, ask your Nextcloud administrator to check Reddit admin settings." : "Ako imate poteškoća s autentifikacijom, zatražite od administratora Nextclouda da provjeri administratorske postavke Reddita.",
    "Make sure to accept the protocol registration on top of this page to allow authentication to Reddit." : "Provjerite jeste li prihvatili registraciju protokola na vrhu ove stranice ako želite dopustiti autentifikaciju na Reddit.",
    "With Chrome/Chromium, you should see a popup on browser top-left to authorize this page to open \"web+nextcloudreddit\" links." : "U pregledniku Chrome/Chromium biste trebali vidjeti skočni prozor s gornje lijeve strane preglednika putem kojeg možete ovlastiti ovu stranicu da otvara poveznice „web+nextcloudreddit“.",
    "If you don't see the popup, you can still click on this icon in the address bar." : "Ako ne vidite skočni prozor, možete kliknuti na ovu ikonu u adresnoj traci.",
    "Then authorize this page to open \"web+nextcloudreddit\" links." : "Zatim ovlastite stranicu da otvara poveznice „web+nextcloudreddit“.",
    "If you still don't manage to get the protocol registered, check your settings on this page:" : "Ako i dalje ne uspijevate registrirati protokol, provjerite postavke na ovoj stranici:",
    "With Firefox, you should see a bar on top of this page to authorize this page to open \"web+nextcloudreddit\" links." : "U pregledniku Firefox biste trebali vidjeti traku pri vrhu ove stranice putem koje možete ovlastiti ovu stranicu da otvara poveznice „web+nextcloudreddit“.",
    "Connect to Reddit" : "Poveži se s Redditom",
    "Connected as {user}" : "Povezan kao {user}",
    "Disconnect from Reddit" : "Odspoji se s Reddita",
    "You must access this page with HTTPS to be able to authenticate to Reddit." : "Morate pristupiti ovoj stranici putem HTTPS-a kako biste mogli izvesti autentifikaciju na Reddit.",
    "Successfully connected to Reddit!" : "Uspješno povezivanje s Redditom!",
    "Reddit OAuth error:" : "Reddit OAuth pogreška:",
    "Nextcloud Reddit integration on {ncUrl}" : "Nextcloud Reddit integracija na {ncUrl}",
    "Reddit options saved" : "Postavke Reddita su spremljene",
    "Failed to save Reddit options" : "Spremanje postavki Reddita nije uspjelo",
    "Failed to save Reddit OAuth state" : "Spremanje stanja Reddit OAuth nije uspjelo",
    "No Reddit account connected" : "Nema povezanih Reddit računa",
    "Error connecting to Reddit" : "Pogreška pri povezivanju s Redditom",
    "No Reddit news!" : "Nema Reddit vijesti!",
    "Failed to get Reddit news" : "Dohvaćanje Reddit vijesti nije uspjelo"
},"pluralForm" :"nplurals=3; plural=n%10==1 && n%100!=11 ? 0 : n%10>=2 && n%10<=4 && (n%100<10 || n%100>=20) ? 1 : 2;"
}