{ "translations": {
    "Error during OAuth exchanges" : "Hiba történt az OAuth üzenetváltások során",
    "Error getting OAuth access token" : "Hiba történt az OAuth hozzáférési token lekérése során",
    "Reddit news" : "Reddit hírek",
    "Comment from %1$s in %2$s" : "Hozzászólás a következőtől: %1$s itt: %2$s",
    "Reddit publications and subreddits" : "Reddit publikációk és subredditek",
    "By @%1$s in %2$s" : "Szerző: %1$s itt: %2$s",
    "Reddit posts" : "Reddit bejegyzések",
    "Subreddits" : "Subredditek",
    "Bad HTTP method" : "Hibás HTTP metódus",
    "Bad credentials" : "Hibás hitelesítő adatok",
    "Failed to get Reddit news" : "Nem sikerült betölteni a Reddit híreket",
    "OAuth access token refused" : "OAuth hozzáférési token elutasítva",
    "Connected accounts" : "Kapcsolt fiókok",
    "Reddit integration" : "Reddit integráció",
    "Integration of Reddit social news aggregation service" : "A Reddit közösségi hírösszesítő szolgáltatásának integrálása",
    "Reddit integration provides a dashboard widget displaying your recent subscribed news." : "A Reddit integráció egy irányítópult modult kínál, amely megjeleníti a legutóbbi híreket, amelyekre feliratkozott.",
    "Reddit admin options saved" : "A Reddit rendszergazdai beállításai mentve",
    "Failed to save Reddit admin options" : "A Reddit rendszergazdai beállításainak mentése sikertelen",
    "There are 3 ways to allow your Nextcloud users to use OAuth to authenticate to Reddit:" : "Háromféleképpen engedélyezheti a Nextcloud felhasználók számára, hogy az OAuth segítségével hitelesítsék magukat a Reddit szolgáltatásban:",
    "Leave all fields empty to use default Nextcloud Reddit OAuth app." : "Az alapértelmezett Nextcloud Reddit OAuth alkalmazás használatához hagyjon üresen minden mezőt.",
    "Create your own Reddit \"web application\" in Reddit preferences and put the application ID and secret below." : "Hozza létre a saját Reddit „webalkalmazását” a Reddit beállításaiban, és írja be alább az alkalmazásazonosítóját és titkát.",
    "Reddit app settings" : "Reddit alkalmazás beállításai",
    "Make sure you set the \"Redirection URI\" to" : "Bizonyosodjon meg róla, hogy erre állította be az „Átirányítási URI\" értéket:",
    "Create your own Reddit \"mobile application\" in Reddit preferences and put the application ID below. Leave the \"Application secret\" field empty." : "Hozzon létre saját Reddit „mobilalkalmazást” a Reddit beállításaiban, és írja be az alkalmazás azonosítóját alább. Hagyja üresen az „Alkalmazás titka” mezőt.",
    "Application ID" : "Alkalmazásazonosító",
    "Client ID of your Reddit application" : "A Reddit alkalmazásának ügyfél-azonosítója",
    "Application secret" : "Alkalmazás titka",
    "Client secret of your Reddit application" : "A Reddit alkalmazásának klienstitka",
    "Successfully connected to Reddit!" : "Sikeresen kapcsolódott a Reddithez!",
    "Reddit OAuth error:" : "Reddit OAuth hiba:",
    "Nextcloud Reddit integration on {ncUrl}" : "Nextcloud Reddit integráció a(z) {ncUrl} oldalon",
    "Reddit options saved" : "A Reddit beállítások mentve",
    "Failed to save Reddit options" : "A Reddit beállítások mentése sikertelen",
    "Failed to save Reddit OAuth state" : "Nem sikerült menteni a Reddit OAuth állapotot",
    "If you have trouble authenticating, ask your Nextcloud administrator to check Reddit admin settings." : "Ha problémája van a hitelesítéssel, kérje meg a Nextcloud rendszergazdáját, hogy ellenőrizze a Reddit rendszergazdai beállításait.",
    "Make sure to accept the protocol registration on top of this page to allow authentication to Reddit." : "Feltétlenül fogadja el a protokoll regisztrációt az oldal tetején, hogy engedélyezhesse a hitelesítést a Reddit számára.",
    "With Chrome/Chromium, you should see a popup on browser top-left to authorize this page to open \"web+nextcloudreddit\" links." : "Ha Chrome-ot vagy Chromiumot használ, akkor látnia kell egy felugró ablakot a böngésző bal felső sarkában, ahol engedélyezheti ennek az oldalnak a „web+nextcloudreddit” hivatkozások megnyitását.",
    "If you don't see the popup, you can still click on this icon in the address bar." : "Ha nem látja a felugró ablakot, kattintson erre az ikonra a címsorban.",
    "Then authorize this page to open \"web+nextcloudreddit\" links." : "Ezután engedélyezze ezt az oldalt a „web+nextcloudreddit” hivatkozások megnyitásához.",
    "If you still don't manage to get the protocol registered, check your settings on this page:" : "Amennyiben még mindig nem sikerült a protokollt regisztrálnia, ellenőrizze a beállításokat ezen az oldalon:",
    "With Firefox, you should see a bar on top of this page to authorize this page to open \"web+nextcloudreddit\" links." : "A Firefoxban ennek az oldalnak a tetején találnia kell egy sávot, ahol engedélyezheti ennek az oldalnak a „web+nextclouddreddit” hivatkozások megnyitását.",
    "Connect to Reddit" : "Csatlakozás a Reddithez",
    "Connected as {user}" : "Kapcsolódva mint {user}",
    "Disconnect from Reddit" : "Kapcsolat bontása a Reddittel",
    "You must access this page with HTTPS to be able to authenticate to Reddit." : "Ezt az oldalt HTTPS kapcsolaton keresztül kell elérni, hogy a Reddit hitelesítés működjön.",
    "No Reddit account connected" : "Nincs Reddit-fiók csatlakoztatva",
    "Error connecting to Reddit" : "Hiba történt a Reddithez való csatlakozáskor",
    "No Reddit news!" : "Nincsenek Reddit hírek."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}