{ "translations": {
    "Error during OAuth exchanges" : "ເກີດຂໍ້ຜິດພາດໃນລະຫວ່າງການແລກປ່ຽນ OAuth",
    "Error getting OAuth access token" : "ຜິດພາດໃນການຮັບ OAuth access token",
    "Reddit news" : "ຂ່າວຈາກ Reddit",
    "Comment from %1$s in %2$s" : "ຄວາມຄິດເຫັນຈາກ %1$s ໃນ %2$s",
    "Reddit publications and subreddits" : "ສິ່ງພິມ ແລະ subreddits ຈາກ Reddit",
    "By @%1$s in %2$s" : "ໂດຍ @%1$s ໃນ %2$s",
    "Reddit posts" : "ໂພສຈາກ Reddit",
    "Subreddits" : "Subreddits",
    "Bad HTTP method" : "HTTP method ບໍ່ຖືກຕ້ອງ",
    "Bad credentials" : "ຂໍ້ມູນຢືນຢັນຕົວຕົນບໍ່ຖືກຕ້ອງ",
    "Failed to get Reddit news" : "ລົ້ມເຫຼວໃນການຮັບຂ່າວຈາກ Reddit",
    "OAuth access token refused" : "OAuth access token ຖືກປະຕິເສດ",
    "Connected accounts" : "ບັນຊີທີ່ເຊື່ອມຕໍ່",
    "Reddit integration" : "ການເຊື່ອມໂຍງ Reddit",
    "Integration of Reddit social news aggregation service" : "ການເຊື່ອມໂຍງບໍລິການລວບລວມຂ່າວສັງຄົມ Reddit",
    "Reddit integration provides a dashboard widget displaying your recent subscribed news." : "ການເຊື່ອມໂຍງ Reddit ສະໜອງວິດເຈັດໜ້າກະດານທີ່ສະແດງຂ່າວທີ່ທ່ານສະໝັກໃຊ້ຫຼ້າສຸດ.",
    "Reddit admin options saved" : "ບັນທຶກຕົວເລືອກຜູ້ເບິ່ງແຍງລະບົບ Reddit ແລ້ວ",
    "Failed to save Reddit admin options" : "ລົ້ມເຫຼວໃນການບັນທຶກຕົວເລືອກຜູ້ເບິ່ງແຍງລະບົບ Reddit",
    "There are 3 ways to allow your Nextcloud users to use OAuth to authenticate to Reddit:" : "ມີ 3 ວິທີໃນການອະນຸຍາດໃຫ້ຜູ້ໃຊ້ Nextcloud ຂອງທ່ານໃຊ້ OAuth ເພື່ອຢືນຢັນຕົວຕົນກັບ Reddit:",
    "Leave all fields empty to use default Nextcloud Reddit OAuth app." : "ປະຊ່ອງທຸກຊ່ອງໃຫ້ວ່າງໄວ້ເພື່ອໃຊ້ແອັບ Nextcloud Reddit OAuth ເລີ່ມຕົ້ນ.",
    "Create your own Reddit \"web application\" in Reddit preferences and put the application ID and secret below." : "ສ້າງ \"ແອັບພລິເຄຊັນເວັບ\" Reddit ຂອງທ່ານເອງໃນການຕັ້ງຄ່າ Reddit ແລະໃສ່ ID ແອັບພລິເຄຊັນ ແລະ ລະຫັດລັບຂ້າງລຸ່ມນີ້.",
    "Reddit app settings" : "ການຕັ້ງຄ່າແອັບ Reddit",
    "Make sure you set the \"Redirection URI\" to" : "ໃຫ້ແນ່ໃຈວ່າທ່ານຕັ້ງ \"Redirection URI\" ເປັນ",
    "Create your own Reddit \"mobile application\" in Reddit preferences and put the application ID below. Leave the \"Application secret\" field empty." : "ສ້າງ \"ແອັບພລິເຄຊັນມືຖື\" Reddit ຂອງທ່ານເອງໃນການຕັ້ງຄ່າ Reddit ແລະໃສ່ ID ແອັບພລິເຄຊັນຂ້າງລຸ່ມນີ້. ປະຊ່ອງ \"ລະຫັດລັບແອັບພລິເຄຊັນ\" ໃຫ້ວ່າງໄວ້.",
    "Application ID" : "ID ແອັບພລິເຄຊັນ",
    "Client ID of your Reddit application" : "ID ລູກຂ່າຍຂອງແອັບພລິເຄຊັນ Reddit ຂອງທ່ານ",
    "Application secret" : "ລະຫັດລັບແອັບພລິເຄຊັນ",
    "Client secret of your Reddit application" : "ລະຫັດລັບລູກຂ່າຍຂອງແອັບພລິເຄຊັນ Reddit ຂອງທ່ານ",
    "Successfully connected to Reddit!" : "ເຊື່ອມຕໍ່ກັບ Reddit ສຳເລັດແລ້ວ!",
    "Reddit OAuth error:" : "ຂໍ້ຜິດພາດ Reddit OAuth:",
    "Nextcloud Reddit integration on {ncUrl}" : "ການເຊື່ອມໂຍງ Nextcloud Reddit ໃນ {ncUrl}",
    "Reddit options saved" : "ບັນທຶກຕົວເລືອກ Reddit ແລ້ວ",
    "Failed to save Reddit options" : "ລົ້ມເຫຼວໃນການບັນທຶກຕົວເລືອກ Reddit",
    "Failed to save Reddit OAuth state" : "ລົ້ມເຫຼວໃນການບັນທຶກສະຖານະ Reddit OAuth",
    "If you have trouble authenticating, ask your Nextcloud administrator to check Reddit admin settings." : "ຫາກທ່ານມີບັນຫາໃນການຢືນຢັນຕົວຕົນ, ໃຫ້ຖາມຜູ້ເບິ່ງແຍງລະບົບ Nextcloud ຂອງທ່ານເພື່ອກວດສອບການຕັ້ງຄ່າຜູ້ເບິ່ງແຍງລະບົບ Reddit.",
    "Make sure to accept the protocol registration on top of this page to allow authentication to Reddit." : "ໃຫ້ແນ່ໃຈວ່າໄດ້ຍອມຮັບການລົງທະບຽນໂປຣໂຕຄໍຢູ່ເທິງສຸດຂອງໜ້ານີ້ເພື່ອອະນຸຍາດການຢືນຢັນຕົວຕົນກັບ Reddit.",
    "With Chrome/Chromium, you should see a popup on browser top-left to authorize this page to open \"web+nextcloudreddit\" links." : "ສຳລັບ Chrome/Chromium, ທ່ານຄວນຈະເຫັນປັອບອັບຢູ່ດ້ານເທິງຊ້າຍຂອງເບົາເຊີ ເພື່ອອະນຸຍາດໃຫ້ໜ້ານີ້ເປີດລິງກ໌ \"web+nextcloudreddit\".",
    "If you don't see the popup, you can still click on this icon in the address bar." : "ຖ້າທ່ານບໍ່ເຫັນປັອບອັບ, ທ່ານຍັງສາມາດຄລິກທີ່ໄອຄອນນີ້ໃນແຖບທີ່ຢູ່ໄດ້.",
    "Then authorize this page to open \"web+nextcloudreddit\" links." : "ຈາກນັ້ນອະນຸຍາດໃຫ້ໜ້ານີ້ເປີດລິງກ໌ \"web+nextcloudreddit\".",
    "If you still don't manage to get the protocol registered, check your settings on this page:" : "ຖ້າທ່ານຍັງບໍ່ສາມາດລົງທະບຽນໂປຣໂຕຄໍໄດ້, ໃຫ້ກວດສອບການຕັ້ງຄ່າຂອງທ່ານໃນໜ້ານີ້:",
    "With Firefox, you should see a bar on top of this page to authorize this page to open \"web+nextcloudreddit\" links." : "ສຳລັບ Firefox, ທ່ານຄວນຈະເຫັນແຖບຢູ່ເທິງສຸດຂອງໜ້ານີ້ ເພື່ອອະນຸຍາດໃຫ້ໜ້ານີ້ເປີດລິງກ໌ \"web+nextcloudreddit\".",
    "Connect to Reddit" : "ເຊື່ອມຕໍ່ກັບ Reddit",
    "Connected as {user}" : "ເຊື່ອມຕໍ່ໃນຊື່ {user}",
    "Disconnect from Reddit" : "ຕັດການເຊື່ອມຕໍ່ຈາກ Reddit",
    "You must access this page with HTTPS to be able to authenticate to Reddit." : "ທ່ານຕ້ອງເຂົ້າເຖິງໜ້ານີ້ດ້ວຍ HTTPS ເພື່ອໃຫ້ສາມາດຢືນຢັນຕົວຕົນກັບ Reddit ໄດ້.",
    "No Reddit account connected" : "ບໍ່ມີບັນຊີ Reddit ເຊື່ອມຕໍ່ຢູ່",
    "Error connecting to Reddit" : "ຜິດພາດໃນການເຊື່ອມຕໍ່ກັບ Reddit",
    "No Reddit news!" : "ບໍ່ມີຂ່າວຈາກ Reddit!"
},"pluralForm" :"nplurals=1; plural=0;"
}