{ "translations": {
    "Error during OAuth exchanges" : "Feil ved utveksling av OAuth",
    "Error getting OAuth access token" : "Feil ved henting av OAuth tilgangsbevis",
    "Reddit news" : "Reddit nyheter",
    "Comment from %1$s in %2$s" : "Kommentar fra %1$s i %2$s",
    "Reddit publications and subreddits" : "Reddit-publikasjoner og under-reddits",
    "By @%1$s in %2$s" : "Av @%1$s i %2$s",
    "Reddit posts" : "Reddit-innlegg",
    "Subreddits" : "Under-reddits",
    "Bad HTTP method" : "HTTP-metode er feil",
    "Bad credentials" : "Påloggingsdetaljene er feil",
    "Failed to get Reddit news" : "Henting av Reddit-nyheter feilet",
    "OAuth access token refused" : "OAuth access token ble avslått",
    "Connected accounts" : "Tilknyttede kontoer",
    "Reddit integration" : "Reddit-integrasjon",
    "Integration of Reddit social news aggregation service" : "Integrasjon av Reddit sosiale nyhetsaggregeringstjeneste",
    "Reddit integration provides a dashboard widget displaying your recent subscribed news." : "Reddit-integrasjon gir en kontrollpanel-widget som viser de siste abonnerte nyhetene dine.",
    "Reddit admin options saved" : "Administrasjonsalternativer for Reddit lagret",
    "Failed to save Reddit admin options" : "Lagring av administrasjonsalternativer for Reddit feilet",
    "There are 3 ways to allow your Nextcloud users to use OAuth to authenticate to Reddit:" : "Det er 3 måter å la Nextcloud-brukerne dine bruke OAuth til å autentisere seg til Reddit:",
    "Leave all fields empty to use default Nextcloud Reddit OAuth app." : "La alle feltene stå tomme for å bruke standard Nextcloud Reddit OAuth-app.",
    "Create your own Reddit \"web application\" in Reddit preferences and put the application ID and secret below." : "Lag din egen Reddit \"webapplikasjon\" i Reddit-preferanser og legg applikasjons-ID og hemmelighet nedenfor.",
    "Reddit app settings" : "Innstillinger for Reddit-appen",
    "Make sure you set the \"Redirection URI\" to" : "Pass på at du setter \"Redirect URI\" til",
    "Create your own Reddit \"mobile application\" in Reddit preferences and put the application ID below. Leave the \"Application secret\" field empty." : "Lag din egen Reddit \"mobilapplikasjon\" i Reddit-preferanser og legg applikasjons-ID-en nedenfor. La feltet «Programhemmelighet» stå tomt.",
    "Application ID" : "Applikasjons-ID",
    "Client ID of your Reddit application" : "Klient-ID-en til Reddit-applikasjonen din",
    "Application secret" : "Søknadshemmelighet",
    "Client secret of your Reddit application" : "Klient-hemmeligheten til Reddit-applikasjonen din",
    "Successfully connected to Reddit!" : "Koblet til Reddit!",
    "Reddit OAuth error:" : "Reddit OAuth-feil:",
    "Nextcloud Reddit integration on {ncUrl}" : "Nextcloud Reddit-integrasjon på {ncUrl}",
    "Reddit options saved" : "Alternativer for Reddit lagret",
    "Failed to save Reddit options" : "Lagring av alternativer for Reddit feilet",
    "Failed to save Reddit OAuth state" : "Lagring av Reddit OAuth-tilstand feilet",
    "If you have trouble authenticating, ask your Nextcloud administrator to check Reddit admin settings." : "Hvis du har problemer med å autentisere deg, kan du be Nextcloud-administratoren om å sjekke administratorinnstillingene for Reddit.",
    "Make sure to accept the protocol registration on top of this page to allow authentication to Reddit." : "Forsikre deg om at du godtok protokollregistreringen øverst på denne siden for å tillate autentisering til Reddit.",
    "With Chrome/Chromium, you should see a popup on browser top-left to authorize this page to open \"web+nextcloudreddit\" links." : "Med Chrome / Chromium bør du se et sprettoppvindu i nettleseren øverst til venstre for å autorisere denne siden til å åpne \"web+nextcloudreddit\" -koblinger.",
    "If you don't see the popup, you can still click on this icon in the address bar." : "Hvis du ikke ser popup-vinduet, kan du fortsatt klikke på dette ikonet i adressefeltet.",
    "Then authorize this page to open \"web+nextcloudreddit\" links." : "Autoriser deretter denne siden til å åpne \"web+nextcloudreddit\"-lenker.",
    "If you still don't manage to get the protocol registered, check your settings on this page:" : "Hvis du fortsatt ikke klarer å få registrert protokollen, sjekk innstillingene dine på denne siden:",
    "With Firefox, you should see a bar on top of this page to authorize this page to open \"web+nextcloudreddit\" links." : "Med Firefox bør du se en linje øverst på denne siden for å autorisere denne siden til å åpne \"web+nextcloudreddit\" -koblinger.",
    "Connect to Reddit" : "Koble til Reddit",
    "Connected as {user}" : "Tilkoblet som {user}",
    "Disconnect from Reddit" : "Koble fra Reddit",
    "You must access this page with HTTPS to be able to authenticate to Reddit." : "Du må få tilgang til denne siden med HTTPS for å kunne autentisere deg til Reddit.",
    "No Reddit account connected" : "Ingen Reddit-konto tilkoblet",
    "Error connecting to Reddit" : "Feil under tilkobling til Reddit",
    "No Reddit news!" : "Ingen Reddit nyheter!"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}