{ "translations": {
    "Error during OAuth exchanges" : "Fout tijdens OAuth uitwisselingen",
    "Error getting OAuth access token" : "Fout bij ophalen OAuth access token",
    "Reddit news" : "Reddit nieuws",
    "Bad HTTP method" : "Foute HTTP methode",
    "Bad credentials" : "Foute inloggegevens",
    "OAuth access token refused" : "OAuth access token geweigerd",
    "Connected accounts" : "Verbonden accounts",
    "Reddit integration" : "Reddit integratie",
    "Integration of Reddit social news aggregation service" : "Integratie met Reddit, sociale nieuwsaggregatiedienst",
    "Reddit integration provides a dashboard widget displaying your recent subscribed news." : "Reddit-integratie biedt een dashboardwidget die je recente abonnementsberichten toont.",
    "There are 3 ways to allow your Nextcloud users to use OAuth to authenticate to Reddit:" : "Er zijn 3 manieren waarop je Nextcloud gebruikers OAuth kunnen gebruiken om te authenticeren bij Reddit:",
    "Leave all fields empty to use default Nextcloud Reddit OAuth app." : "Laat alle velden blanco om de standaard Nextcloud Reddit OAuth app te gebruiken.",
    "Create your own Reddit \"web application\" in Reddit preferences and put the application ID and secret below." : "Maak je eigen Reddit \"webapplicatie\" in Reddit-voorkeuren en plaats het applicatie-ID en secret hieronder.",
    "Reddit app settings" : "Reddit app instellingen",
    "Make sure you set the \"Redirection URI\" to" : "Zorg ervoor dat de \"Redirect URI\" is ingesteld op",
    "Create your own Reddit \"mobile application\" in Reddit preferences and put the application ID below. Leave the \"Application secret\" field empty." : "Maak je eigen Reddit \"mobiele applicatie\" in Reddit-voorkeuren en plaats het applicatie-ID hieronder. Laat het veld \"Application secret\" leeg.",
    "Application ID" : "Application ID",
    "Client ID of your Reddit application" : "Client ID van je Reddit applicatie",
    "Application secret" : "Application secret",
    "Client secret of your Reddit application" : "Client secret van je Reddit applicatie",
    "Reddit admin options saved" : "Reddit admin opties opgeslagen",
    "Failed to save Reddit admin options" : "Kon Reddit admin-opties niet opslaan",
    "If you have trouble authenticating, ask your Nextcloud administrator to check Reddit admin settings." : "Als je problemen ondervindt bij het authenticeren, vraagt je je Nextcloudbeheerder om de beheerdersinstellingen van Reddit te controleren.",
    "Make sure to accept the protocol registration on top of this page to allow authentication to Reddit." : "Accepteer de protocol-registratie bovenaan deze pagina om authenticatie bij Reddit mogelijk te maken.",
    "With Chrome/Chromium, you should see a popup on browser top-left to authorize this page to open \"web+nextcloudreddit\" links." : "In Chrome/Chromium zou je linksboven in de browser een pop-up moeten zien om deze pagina toestemming te geven om \"web+nextcloudreddit\" links te openen.",
    "If you don't see the popup, you can still click on this icon in the address bar." : "Als u deze pop-up niet ziet, kunt u not steeds op dit icoon in de adresbalk klikken.",
    "Then authorize this page to open \"web+nextcloudreddit\" links." : "Geef daarna toestemming aan deze pagina om \"web+nextcloudreddit\" links te openen.",
    "If you still don't manage to get the protocol registered, check your settings on this page:" : "Als je het protocol nog steeds niet kunt registreren, controleer dan de instellingen op deze pagina:",
    "With Firefox, you should see a bar on top of this page to authorize this page to open \"web+nextcloudreddit\" links." : "In Firefox zou je bovenaan de pagina een balk moeten zien om toestemming te geven om \"web+nextcloudreddit\" links te openen.",
    "Connect to Reddit" : "Verbinden met Reddit",
    "Connected as {user}" : "Verbonden als {user}",
    "Disconnect from Reddit" : "Verbreek de verbinding met Reddit",
    "You must access this page with HTTPS to be able to authenticate to Reddit." : "Je moet deze pagina openen met HTTPS om te kunnen authenticeren bij Reddit.",
    "Successfully connected to Reddit!" : "Succesvol verbonden met Reddit!",
    "Reddit OAuth error:" : "Reddit OAuth fout:",
    "Nextcloud Reddit integration on {ncUrl}" : "Nextcloud Reddit-integratie op {ncUrl}",
    "Reddit options saved" : "Reddit opties opgeslagen",
    "Failed to save Reddit options" : "Kon Reddit-opties niet opslaan",
    "Failed to save Reddit OAuth state" : "Kon Reddit OAuth-status niet bewaren",
    "No Reddit account connected" : "Geen Reddit-account verbonden",
    "Error connecting to Reddit" : "Fout bij het verbinden met Reddit",
    "No Reddit news!" : "Geen Reddit nieuws!",
    "Failed to get Reddit news" : "Kon Reddit nieuws niet ophalen"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}