{ "translations": {
    "Error during OAuth exchanges" : "Erro durante trocas OAuth",
    "Error getting OAuth access token" : "Erro ao obter o token de acesso OAuth",
    "Reddit news" : "Notícias do Reddit",
    "Bad HTTP method" : "Método HTTP ruim",
    "Bad credentials" : "Credenciais erradas",
    "Token is not valid anymore. Impossible to refresh it." : "O token não é mais válido. Impossível atualizá-lo.",
    "OAuth access token refused" : "Token de acesso OAuth recusado",
    "Connected accounts" : "Contas conectadas",
    "Reddit integration" : "Integração Reddit",
    "Integration of Reddit social news aggregation service" : "Integração do serviço de agregação de notícias sociais Reddit",
    "Reddit integration provides a dashboard widget displaying your recent subscribed news." : "A integração do Reddit fornece um widget de painel exibindo as notícias recentes assinadas.",
    "There are 3 ways to allow your Nextcloud users to use OAuth to authenticate to Reddit:" : "Existem 3 maneiras de permitir que seus usuários Nextcloud usem OAuth para se autenticar no Reddit:",
    "Leave all fields empty to use default Nextcloud Reddit OAuth app." : "Deixe todos os campos vazios para usar o aplicativo Nextcloud Reddit OAuth padrão.",
    "Create your own Reddit \"web application\" in Reddit preferences and put the application ID and secret below." : "Crie seu próprio \"aplicativo da web\" do Reddit nas preferências do Reddit e coloque o ID e o segredo do aplicativo abaixo.",
    "Reddit app settings" : "Configurações do aplicativo Reddit",
    "Make sure you set the \"Redirection URI\" to" : "Certifique-se de definir o \"URI de redirecionamento\" para ",
    "Create your own Reddit \"mobile application\" in Reddit preferences and put the application ID below. Leave the \"Application secret\" field empty." : "Crie seu próprio \"aplicativo móvel\" do Reddit nas preferências do Reddit e coloque o ID do aplicativo abaixo. Deixe o campo \"Segredo do aplicativo\" vazio.",
    "Application ID" : "ID do aplicativo",
    "Client ID of your Reddit application" : "ID de cliente do seu aplicativo Reddit",
    "Application secret" : "Segredo do aplicativo",
    "Client secret of your Reddit application" : "Segredo do cliente do seu aplicativo Reddit",
    "Reddit admin options saved" : "Opções de administração do Reddit salvas",
    "Failed to save Reddit admin options" : "Falha ao salvar as opções de administração do Reddit",
    "If you have trouble authenticating, ask your Nextcloud administrator to check Reddit admin settings." : "Se você tiver problemas para autenticar, peça ao administrador do Nextcloud para verificar as configurações de administrador do Reddit.",
    "Make sure to accept the protocol registration on top of this page to allow authentication to Reddit." : "Certifique-se de aceitar o registro do protocolo no topo desta página para permitir a autenticação no Reddit.",
    "With Chrome/Chromium, you should see a popup on browser top-left to authorize this page to open \"web+nextcloudreddit\" links." : "Com o Chrome / Chromium, você deve ver um pop-up no canto superior esquerdo do navegador para autorizar esta página a abrir links \"web + nextcloudreddit\".",
    "If you don't see the popup, you can still click on this icon in the address bar." : "Se você não vir o pop-up, ainda poderá clicar neste ícone na barra de endereço.",
    "Then authorize this page to open \"web+nextcloudreddit\" links." : "Em seguida, autorize esta página a abrir os links \"web + nextcloudreddit\".",
    "If you still don't manage to get the protocol registered, check your settings on this page:" : "Se você ainda não conseguiu registrar o protocolo, verifique suas configurações nesta página:",
    "With Firefox, you should see a bar on top of this page to authorize this page to open \"web+nextcloudreddit\" links." : "Com o Firefox, você deve ver uma barra no topo desta página para autorizar esta página a abrir links \"web + nextcloudreddit\".",
    "Connect to Reddit" : "Conectar-se ao Reddit",
    "Connected as {user}" : "Conectado como {user}",
    "Disconnect from Reddit" : "Desconectar do Reddit",
    "You must access this page with HTTPS to be able to authenticate to Reddit." : "Você deve acessar esta página com HTTPS para poder autenticar-se ao Reddit.",
    "Successfully connected to Reddit!" : "Conectado com sucesso ao Reddit!",
    "Reddit OAuth error:" : "Erro Reddit OAuth:",
    "Nextcloud Reddit integration on {ncUrl}" : "Integração Nextcloud Reddit em {ncUrl}",
    "Reddit options saved" : "Opções do Reddit salvas",
    "Failed to save Reddit options" : "Falha ao salvar opções do Reddit",
    "Failed to save Reddit OAuth state" : "Falha ao salvar o estado do Reddit OAuth",
    "No Reddit account connected" : "Nenhuma conta do Reddit conectada",
    "Error connecting to Reddit" : "Erro ao conectar ao Reddit",
    "No Reddit news!" : "Sem notícias do Reddit!",
    "Failed to get Reddit news" : "Falha ao obter notícias do Reddit"
},"pluralForm" :"nplurals=3; plural=(n == 0 || n == 1) ? 0 : n != 0 && n % 1000000 == 0 ? 1 : 2;"
}