{ "translations": {
    "Error during OAuth exchanges" : "Chyba počas výmeny OAuth",
    "Error getting OAuth access token" : "Chyba pri získavaní prístupového tokenu OAuth",
    "Reddit news" : "Správy na Reddite",
    "Comment from %1$s in %2$s" : "Komentár od %1$s v %2$s",
    "Reddit publications and subreddits" : "Príspevky Reddit a subredit",
    "By @%1$s in %2$s" : "Od @%1$s v %2$s",
    "Reddit posts" : "Príspevky na Reddite",
    "Subreddits" : "Subredity",
    "Bad HTTP method" : "Zlá metóda HTTP",
    "Bad credentials" : "Nesprávne prihlasovacie údaje",
    "Failed to get Reddit news" : "Nepodarilo sa získať novinky z Redditu",
    "OAuth access token refused" : "Prístupový token OAuth bol zamietnutý",
    "Connected accounts" : "Prepojené účty",
    "Reddit integration" : "Reddit integrácia",
    "Integration of Reddit social news aggregation service" : "Integrácia služby agregácie sociálnych správ Reddit",
    "Reddit integration provides a dashboard widget displaying your recent subscribed news." : "Integrácia s Reddit poskytuje ovládací prvok pre prehľad, zobrazujúcí nedávne novinky, k odberu ktorým ste prihlásený.",
    "There are 3 ways to allow your Nextcloud users to use OAuth to authenticate to Reddit:" : "Existujú 3 spôsoby, ako umožniť používateľom Nextcloud používať OAuth na autentifikáciu k serveru Reddit:",
    "Leave all fields empty to use default Nextcloud Reddit OAuth app." : "Ak chcete použiť predvolenú aplikáciu Nextcloud Reddit OAuth, nechajte všetky polia prázdne.",
    "Create your own Reddit \"web application\" in Reddit preferences and put the application ID and secret below." : "Vytvorte si vlastnú „mobilnú aplikáciu“ Reddit v predvoľbách Redditu a nižšie uveďte ID a tajomstvo aplikácie",
    "Reddit app settings" : "Nastavenia aplikácie Reddit",
    "Make sure you set the \"Redirection URI\" to" : "Nezabudnite nastaviť \"Redirect URI\" na",
    "Create your own Reddit \"mobile application\" in Reddit preferences and put the application ID below. Leave the \"Application secret\" field empty." : "Vytvorte si vlastnú „mobilnú aplikáciu“ Reddit v predvoľbách Redditu a nižšie uveďte ID aplikácie. Pole „Tajomstvo aplikácie“ nechajte prázdne.",
    "Application ID" : "ID aplikácie",
    "Client ID of your Reddit application" : "ID klienta vašej aplikácie Reddit",
    "Application secret" : "Aplikačný tajný kľúč",
    "Client secret of your Reddit application" : "Tajomstvo klienta vašej aplikácie Reddit",
    "Reddit admin options saved" : "Možnosti administrátora Reddit boli uložené",
    "Failed to save Reddit admin options" : "Nepodarilo sa uložiť možnosti administrátora Reddit",
    "If you have trouble authenticating, ask your Nextcloud administrator to check Reddit admin settings." : "Ak máte problémy s autentifikáciou, požiadajte svojho správcu Nextcloud, aby skontroloval nastavenia správcu Reddit.",
    "Make sure to accept the protocol registration on top of this page to allow authentication to Reddit." : "Ak sa chcete autentizovať v Reddite, uistite sa, že ste prijali registráciu protokolu v hornej časti tejto stránky.",
    "With Chrome/Chromium, you should see a popup on browser top-left to authorize this page to open \"web+nextcloudreddit\" links." : "V prípade prehliadača Chrome/Chromium by sa v hornej ľavej časti tejto stránky mala zobraziť lišta, ktorá autorizuje túto stránku na otváranie odkazov „web + nextcloudreddit“.",
    "If you don't see the popup, you can still click on this icon in the address bar." : "Ak nevidíte vyskakovacie okno, stále môžete kliknúť na túto ikonu v paneli s adresou.",
    "Then authorize this page to open \"web+nextcloudreddit\" links." : "Potom autorizujte túto stránku na otvorenie odkazov „web + nextcloudreddit“.",
    "If you still don't manage to get the protocol registered, check your settings on this page:" : "Ak sa vám nepodarí protokol zaregistrovať, skontrolujte svoje nastavenia na tejto stránke:",
    "With Firefox, you should see a bar on top of this page to authorize this page to open \"web+nextcloudreddit\" links." : "V prípade prehliadača Firefox by sa v hornej časti tejto stránky mala zobraziť lišta, ktorá autorizuje túto stránku na otváranie odkazov „web + nextcloudreddit“.",
    "Connect to Reddit" : "Pripojiť k Redditu",
    "Connected as {user}" : "Pripojený ako {user}",
    "Disconnect from Reddit" : "Odpojiť od Redditu",
    "You must access this page with HTTPS to be able to authenticate to Reddit." : "Na túto stránku musíte pristupovať pomocou protokolu HTTPS, aby ste sa mohli autentifikovať na serveri Reddit.",
    "Successfully connected to Reddit!" : "Úspešne pripojené k Redditu!",
    "Reddit OAuth error:" : "Chyba Reddit OAuth:",
    "Nextcloud Reddit integration on {ncUrl}" : "Integrácia Nextcloud Reddit na {ncUrl}",
    "Reddit options saved" : "Nastavenia Redditu boli uložené",
    "Failed to save Reddit options" : "Nepodarilo sa uložiť nastavenia Redditu",
    "Failed to save Reddit OAuth state" : "Nepodarilo sa uložiť stav OAuth Redditu",
    "No Reddit account connected" : "Nie je pripojený žiadny Reddit účet",
    "Error connecting to Reddit" : "Chyba pri pripájaní k Redditu",
    "No Reddit news!" : "Žiadne novinky na Reddite!"
},"pluralForm" :"nplurals=4; plural=(n % 1 == 0 && n == 1 ? 0 : n % 1 == 0 && n >= 2 && n <= 4 ? 1 : n % 1 != 0 ? 2: 3);"
}