{ "translations": {
    "Error during OAuth exchanges" : "Napaka med izmenjavo podatkov OAuth",
    "Error getting OAuth access token" : "Napaka med pridobivanjem žetona OAuth za dostop",
    "Reddit news" : "Novice Reddit",
    "Bad HTTP method" : "Neustrezna metoda HTTP",
    "Bad credentials" : "Neustrezna poverila",
    "Failed to get Reddit news" : "Pridobivanje novic Reddit je spodletelo",
    "OAuth access token refused" : "Žeton OAuth za dostop je bil zavrnjen",
    "Connected accounts" : "Povezani računi",
    "Reddit integration" : "Združevalnik Reddit",
    "Integration of Reddit social news aggregation service" : "Podpora za storitve zbirnika novic Reddit",
    "Reddit integration provides a dashboard widget displaying your recent subscribed news." : "Podpora za Reddit omogoča gradnike za prikazovanje pomembnih naročenih novic.",
    "There are 3 ways to allow your Nextcloud users to use OAuth to authenticate to Reddit:" : "Na voljo so 3 načini za omogočanje uporabe OAuth za overitev povezave z okoljem Reddit:",
    "Leave all fields empty to use default Nextcloud Reddit OAuth app." : "Za uporabo privzetega programa za overitev računa Reddit z OAuth pustite polja prazna.",
    "Create your own Reddit \"web application\" in Reddit preferences and put the application ID and secret below." : "Ustvarite svoj »spletni program« med nastavitvami Reddit in nato vpišite ID programa in geslo v spodnja polja.",
    "Reddit app settings" : "Nastavitve programa Reddit",
    "Make sure you set the \"Redirection URI\" to" : "Poskrbite, da bo »preusmeritveni naslov URI« nastavljen na",
    "Create your own Reddit \"mobile application\" in Reddit preferences and put the application ID below. Leave the \"Application secret\" field empty." : "Ustvarite svoj »mobilni program« med nastavitvami Reddit in nato vpišite ID programa v spodnje polje. Polje gesla pustite prazno.",
    "Application ID" : "ID Programa",
    "Client ID of your Reddit application" : "ID Odjemalca programa Reddit",
    "Application secret" : "Koda programa",
    "Client secret of your Reddit application" : "Koda programa za povezavo z računom Reddit",
    "Reddit admin options saved" : "Skrbniške nastavitve povezave Reddit so shranjene",
    "Failed to save Reddit admin options" : "Shranjevanje skrbniških nastavitev računa Reddit je spodletelo",
    "If you have trouble authenticating, ask your Nextcloud administrator to check Reddit admin settings." : "Če imate težave z overitvijo, stopite v stik s skrbnikom sistema za preverjanje skrbniških nastavitev Reddit.",
    "Make sure to accept the protocol registration on top of this page to allow authentication to Reddit." : "Vpis protokola na vrhu te strani je treba odobriti in nato dovoliti overitev okolja Reddit.",
    "With Chrome/Chromium, you should see a popup on browser top-left to authorize this page to open \"web+nextcloudreddit\" links." : "Pri uporabi brskalnika Chrome/Chromium bi morali videti pojavno okno v zgornjem levem kotu za overitev odpiranja povezav »web+nextcloudreddit«.",
    "If you don't see the popup, you can still click on this icon in the address bar." : "Če se pojavno okno ne pokaže, je to še vedno mogoče odpreti s klikom na ikono v naslovni vrstici.",
    "Then authorize this page to open \"web+nextcloudreddit\" links." : "Nato overite to stran za odpiranje povezav »web+nextcloudreddit«.",
    "If you still don't manage to get the protocol registered, check your settings on this page:" : "Če še vedno ni mogoče vpisati protokola, preverite nastavitve na tej strani:",
    "With Firefox, you should see a bar on top of this page to authorize this page to open \"web+nextcloudreddit\" links." : "Pri uporabi brskalnika Firefox bi morali videti vrstico na vrhu te strani za overitev odpiranja povezav »web+nextcloudreddit«.",
    "Connect to Reddit" : "Poveži z računom Reddit",
    "Connected as {user}" : "Povezan je uporabniški račun {user}",
    "Disconnect from Reddit" : "Prekini povezavo z Reddit",
    "You must access this page with HTTPS to be able to authenticate to Reddit." : "Za overitev računa Reddit mora biti vzpostavljena povezava prek protokola HTTPS.",
    "Successfully connected to Reddit!" : "Povezava z Reddit je uspešno vzpostavljena!",
    "Reddit OAuth error:" : "Napaka overitve OAuth za Reddit:",
    "Nextcloud Reddit integration on {ncUrl}" : "Združevalnik Reddit na naslovu {ncUrl}",
    "Reddit options saved" : "Nastavitve Reddit so shranjene",
    "Failed to save Reddit options" : "Shranjevanje nastavitev Reddit je spodletelo",
    "Failed to save Reddit OAuth state" : "Shranjevanje stanja Reddit OAuth je spodletelo",
    "No Reddit account connected" : "Ni še povezanega računa Reddit",
    "Error connecting to Reddit" : "Napaka povezovanja z računom Reddit",
    "No Reddit news!" : "NiI novic Reddit!"
},"pluralForm" :"nplurals=4; plural=(n%100==1 ? 0 : n%100==2 ? 1 : n%100==3 || n%100==4 ? 2 : 3);"
}