{ "translations": {
    "Error during OAuth exchanges" : "Грешко приликом OAuth размена",
    "Error getting OAuth access token" : "Грешка при добијању OAuth приступног жетона",
    "Reddit news" : "Reddit новости",
    "Comment from %1$s in %2$s" : "Коментар %1$s у %2$s",
    "Reddit publications and subreddits" : "Reddit објаве и subreddits",
    "By @%1$s in %2$s" : "Објавио @%1$s у %2$s",
    "Reddit posts" : "Reddit објаве",
    "Subreddits" : "Subreddits",
    "Bad HTTP method" : "Лоша HTTP метода",
    "Bad credentials" : "Лоши креденцијали",
    "Failed to get Reddit news" : "Није успело добављање Reddit новости",
    "OAuth access token refused" : "Одбијен је OAuth приступни жетон",
    "Connected accounts" : "Повезани налози",
    "Reddit integration" : "Reddit интеграција",
    "Integration of Reddit social news aggregation service" : "интеграција Reddit сервиса за агрегацију друштвених вести",
    "Reddit integration provides a dashboard widget displaying your recent subscribed news." : "Reddit интеграција обезбеђује виџет контролне табле који приказује скорашње вести на које сте се претплатили.",
    "Reddit admin options saved" : "Сачуване су Reddit админ опције",
    "Failed to save Reddit admin options" : "Није успело чување Reddit админ опција",
    "There are 3 ways to allow your Nextcloud users to use OAuth to authenticate to Reddit:" : "Постоји 3 начина која омогућавају да ваши Nextcloud корисници користе OAuth за пријаву на Reddit:",
    "Leave all fields empty to use default Nextcloud Reddit OAuth app." : "Оставите сва поља празна ако желите да се користи подразумевана Nextcloud Reddit OAuth апликаиција.",
    "Create your own Reddit \"web application\" in Reddit preferences and put the application ID and secret below." : "Креирајте сопствену Reddit „веб апликацију” у Reddit подешавањима и унесите ID апликације и тајну испод.",
    "Reddit app settings" : "Подешавања Reddit апликације",
    "Make sure you set the \"Redirection URI\" to" : "Осигурајте да поставите „Redirect URI” на",
    "Create your own Reddit \"mobile application\" in Reddit preferences and put the application ID below. Leave the \"Application secret\" field empty." : "Креирајте сопствену Reddit „мобилну апликацију” у Reddit подешавањима и унесите ID апликације испод. Оставите „Тајна апликације” празно.",
    "Application ID" : "ID апликације",
    "Client ID of your Reddit application" : "Клијент ID ваше Reddit апликације",
    "Application secret" : "Тајна апликације",
    "Client secret of your Reddit application" : "Клијентска тајна ваше Reddit апликације",
    "Successfully connected to Reddit!" : "Успешно је успостављена веза са Reddit!",
    "Reddit OAuth error:" : "Reddit OAuth грешка:",
    "Nextcloud Reddit integration on {ncUrl}" : "Nextcloud Reddit интеграција на {ncUrl}",
    "Reddit options saved" : "Сачуване су Reddit опције",
    "Failed to save Reddit options" : "Није успело чување Reddit опција",
    "Failed to save Reddit OAuth state" : "Није успело чување Reddit OAuth стања",
    "If you have trouble authenticating, ask your Nextcloud administrator to check Reddit admin settings." : "Ако имате проблама са аутентификацијом, замолите свог Nextcloud администратора да провери Reddit админ подешавања.",
    "Make sure to accept the protocol registration on top of this page to allow authentication to Reddit." : "Будите сигурни да прихватате регистрацију протокола на врху ове странице ако желите да се аутентификујете сервису Reddit.",
    "With Chrome/Chromium, you should see a popup on browser top-left to authorize this page to open \"web+nextcloudreddit\" links." : "Са Chrome/Chromium, требало би да видите искачући прозор у горњем левом делу прозора прегледача којим дозвољавате страници да отвори „web+nextcloudreddit” линкове.",
    "If you don't see the popup, you can still click on this icon in the address bar." : "Ако не видите искачући прозор, можете да клинете на ову иконицу у адресној линији.",
    "Then authorize this page to open \"web+nextcloudreddit\" links." : "Затим дозволите да ова страна отвара „web+nextcloudreddit” линкове.",
    "If you still don't manage to get the protocol registered, check your settings on this page:" : "Ако још увек не успевате да региструјете протокол, проверите своја подешавања на овој страници:",
    "With Firefox, you should see a bar on top of this page to authorize this page to open \"web+nextcloudreddit\" links." : "Са Firefox, требало би да видите линију на врху ове странице којом дозвољавате страници да отвара „web+nextcloudreddit” линкове.",
    "Connect to Reddit" : "Повежи се са Reddit",
    "Connected as {user}" : "Повезан као {user}",
    "Disconnect from Reddit" : "Прекини везу са Reddit",
    "You must access this page with HTTPS to be able to authenticate to Reddit." : "Да бисте се пријавили на Reddit, овој страници морате да приступите преко HTTPS.",
    "No Reddit account connected" : "Није повезан ниједан Reddit налог",
    "Error connecting to Reddit" : "Грешка приликом повезивања са Reddit",
    "No Reddit news!" : "Нема Reddit новости!"
},"pluralForm" :"nplurals=3; plural=(n%10==1 && n%100!=11 ? 0 : n%10>=2 && n%10<=4 && (n%100<10 || n%100>=20) ? 1 : 2);"
}