{ "translations": {
    "Error during OAuth exchanges" : "Hitilafu wakati wa kubadilishana OAuth",
    "Error getting OAuth access token" : "Hitilafu katika kupata token ya ufikiaji ya OAuth",
    "Reddit news" : "Habari za Reddit",
    "Comment from %1$s in %2$s" : "Toa maoni kutoka %1$s katika %2$s",
    "Reddit publications and subreddits" : "Machapisho ya Reddit na subreddits",
    "By @%1$s in %2$s" : "Na @%1$s katika %2$s",
    "Reddit posts" : "Machapisho ya Reddit",
    "Subreddits" : "Subreddits",
    "Bad HTTP method" : "Njia mbaya ya HTTP ",
    "Bad credentials" : "Sifa mbaya",
    "Failed to get Reddit news" : "Imeshindwa kupata habari za Reddit",
    "OAuth access token refused" : "Ufikiaji wa token za OAuth umekataliwa",
    "Connected accounts" : "Akaunti zilizounganishwa",
    "Reddit integration" : "Ujumuishaji wa Reddit",
    "Integration of Reddit social news aggregation service" : "Ujumuishaji wa huduma ya mkusanyiko wa habari za kijamii za Reddit",
    "Reddit integration provides a dashboard widget displaying your recent subscribed news." : "Ujumuishaji wa Reddit hutoa wijeti ya dashibodi inayoonyesha habari ulizofuatilia hivi majuzi.",
    "Reddit admin options saved" : "Chaguo za msimamizi wa Reddit zimehifadhiwa",
    "Failed to save Reddit admin options" : "Imeshindwa kuhifadhi chaguo za msimamizi wa Reddit",
    "There are 3 ways to allow your Nextcloud users to use OAuth to authenticate to Reddit:" : "Kuna njia 3 za kuruhusu watumiaji wako wa Nextcloud kutumia OAuth kuthibitisha kwa Reddit:",
    "Leave all fields empty to use default Nextcloud Reddit OAuth app." : "Acha sehemu zote tupu ili kutumia programu chaguomsingi ya Nextcloud Reddit OAuth.",
    "Create your own Reddit \"web application\" in Reddit preferences and put the application ID and secret below." : "Unda \"programu ya wavuti\" yako mwenyewe ya Reddit katika mapendeleo ya Reddit na uweke kitambulisho cha programu na siri hapa chini.",
    "Reddit app settings" : "Mipangilio ya programu ya Reddit",
    "Make sure you set the \"Redirection URI\" to" : "Hakikisha umeweka \"URI ya kuelekeza upya\".",
    "Create your own Reddit \"mobile application\" in Reddit preferences and put the application ID below. Leave the \"Application secret\" field empty." : "Unda \"programu ya rununu\" yako mwenyewe ya Reddit katika mapendeleo ya Reddit na uweke kitambulisho cha programu hapa chini. Acha uga wa \"Siri ya Maombi\" tupu.",
    "Application ID" : "Kitambulisho cha maombi",
    "Client ID of your Reddit application" : "Kitambulisho cha Mteja cha programu yako ya Reddit",
    "Application secret" : "Siri ya maombi",
    "Client secret of your Reddit application" : "Siri ya mteja ya programu yako ya Reddit",
    "Successfully connected to Reddit!" : "Imeunganishwa kwa Reddit!",
    "Reddit OAuth error:" : "Hitilafu ya Reddit OAuth:",
    "Nextcloud Reddit integration on {ncUrl}" : " Muunganisho wa Nextcloud Reddit umewashwa {ncUrl}",
    "Reddit options saved" : "Chaguo za Reddit zimehifadhiwa",
    "Failed to save Reddit options" : "Imeshindwa kuhifadhi chaguo za Reddit",
    "Failed to save Reddit OAuth state" : "Imeshindwa kuhifadhi hali ya Reddit OAuth",
    "If you have trouble authenticating, ask your Nextcloud administrator to check Reddit admin settings." : "Ikiwa unatatizika kuthibitisha, muulize msimamizi wako wa Nextcloud aangalie mipangilio ya msimamizi wa Reddit.",
    "Make sure to accept the protocol registration on top of this page to allow authentication to Reddit." : "Hakikisha kuwa umekubali usajili wa itifaki juu ya ukurasa huu ili kuruhusu uthibitishaji kwa Reddit.",
    "With Chrome/Chromium, you should see a popup on browser top-left to authorize this page to open \"web+nextcloudreddit\" links." : "Ukiwa na Chrome/Chromium, unapaswa kuona dirisha ibukizi kwenye kivinjari juu kushoto ili kuidhinisha ukurasa huu kufungua viungo vya \"web+nextcloudreddit\".",
    "If you don't see the popup, you can still click on this icon in the address bar." : "Ikiwa huoni dirisha ibukizi, bado unaweza kubofya ikoni hii kwenye upau wa anwani.",
    "Then authorize this page to open \"web+nextcloudreddit\" links." : "Kisha uidhinishe ukurasa huu kufungua viungo vya \"web+nextcloudreddit\".",
    "If you still don't manage to get the protocol registered, check your settings on this page:" : "Ikiwa bado hutaweza kusajili itifaki, angalia mipangilio yako kwenye ukurasa huu:",
    "With Firefox, you should see a bar on top of this page to authorize this page to open \"web+nextcloudreddit\" links." : "Ukiwa na Firefox, unapaswa kuona upau juu ya ukurasa huu ili kuidhinisha ukurasa huu kufungua viungo vya \"web+nextcloudreddit\".",
    "Connect to Reddit" : "Unganisha kwa Reddit",
    "Connected as {user}" : "Imeunganishwa kama {user}",
    "Disconnect from Reddit" : "Tenganisha kutoka kwa Reddit",
    "You must access this page with HTTPS to be able to authenticate to Reddit." : "Lazima ufikie ukurasa huu kwa HTTPS ili uweze kuthibitisha kwa Reddit.",
    "No Reddit account connected" : "Hakuna akaunti ya Reddit iliyounganishwa",
    "Error connecting to Reddit" : "Hitilafu katika kuunganisha kwa Reddit",
    "No Reddit news!" : "Hakuna habari za Reddit!"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}