{ "translations": {
    "Error during OAuth exchanges" : "Помилка під час обміну OAuth",
    "Error getting OAuth access token" : "Помилка отримання токена доступу OAuth",
    "Reddit news" : "Новини Reddit",
    "Comment from %1$s in %2$s" : "Коментар з %1$s в %2$s",
    "Reddit publications and subreddits" : "Публікації та субредактиви Reddit",
    "By @%1$s in %2$s" : "На @%1$s в %2$s",
    "Reddit posts" : "Дописи на Reddit",
    "Subreddits" : "Субкредити",
    "Bad HTTP method" : "Поганий метод HTTP",
    "Bad credentials" : "Погані облікові дані",
    "Failed to get Reddit news" : "Не вдалося отримати новини Reddit",
    "OAuth access token refused" : "Токен доступу OAuth відхилено",
    "Connected accounts" : "Підключені облікові записи",
    "Reddit integration" : "Інтеграція з Reddit",
    "Integration of Reddit social news aggregation service" : "Інтеграція сервісу агрегації соціальних новин Reddit",
    "Reddit integration provides a dashboard widget displaying your recent subscribed news." : "Інтеграція з Reddit надає віджет інформаційної панелі, що відображає останні новини, на які ви підписалися.",
    "Reddit admin options saved" : "Параметри адміністратора Reddit збережено",
    "Failed to save Reddit admin options" : "Не вдалося зберегти параметри адміністратора Reddit",
    "There are 3 ways to allow your Nextcloud users to use OAuth to authenticate to Reddit:" : "Існує 3 способи дозволити вашим користувачам Nextcloud використовувати OAuth для автентифікації на Reddit:",
    "Leave all fields empty to use default Nextcloud Reddit OAuth app." : "Залиште всі поля порожніми, щоб використовувати стандартний додаток Nextcloud Reddit OAuth.",
    "Create your own Reddit \"web application\" in Reddit preferences and put the application ID and secret below." : "Створіть власний \"веб-додаток\" Reddit у налаштуваннях Reddit і введіть ідентифікатор і секрет додатку нижче.",
    "Reddit app settings" : "Налаштування програми Reddit",
    "Make sure you set the \"Redirection URI\" to" : "Переконайтеся, що ви встановили для параметра \"URI перенаправлення\" значення",
    "Create your own Reddit \"mobile application\" in Reddit preferences and put the application ID below. Leave the \"Application secret\" field empty." : "Створіть власний \"мобільний додаток\" Reddit у налаштуваннях Reddit і введіть ідентифікатор додатку нижче. Поле \"Секрет додатку\" залиште порожнім.",
    "Application ID" : "Ідентифікатор заявки",
    "Client ID of your Reddit application" : "Ідентифікатор клієнта вашого додатку Reddit",
    "Application secret" : "Секрет заявки",
    "Client secret of your Reddit application" : "Клієнтська таємниця вашого додатку Reddit",
    "Successfully connected to Reddit!" : "Успішно підключено до Reddit!",
    "Reddit OAuth error:" : "Помилка Reddit OAuth:",
    "Nextcloud Reddit integration on {ncUrl}" : "Інтеграція з Reddit у Nextcloud {ncUrl}",
    "Reddit options saved" : "Параметри Reddit збережено",
    "Failed to save Reddit options" : "Не вдалося зберегти параметри Reddit",
    "Failed to save Reddit OAuth state" : "Не вдалося зберегти стан Reddit OAuth",
    "If you have trouble authenticating, ask your Nextcloud administrator to check Reddit admin settings." : "Якщо у вас виникли проблеми з автентифікацією, попросіть адміністратора Nextcloud перевірити налаштування адміністратора Reddit.",
    "Make sure to accept the protocol registration on top of this page to allow authentication to Reddit." : "Обов'язково прийміть реєстрацію протоколу вгорі цієї сторінки, щоб дозволити автентифікацію на Reddit.",
    "With Chrome/Chromium, you should see a popup on browser top-left to authorize this page to open \"web+nextcloudreddit\" links." : "У браузері Chrome/Chromium у верхньому лівому кутку браузера має з'явитися спливаюче вікно з проханням авторизувати цю сторінку для відкриття посилань \"web+nextcloudreddit\".",
    "If you don't see the popup, you can still click on this icon in the address bar." : "Якщо ви не бачите спливаюче вікно, ви можете натиснути на цю іконку в адресному рядку.",
    "Then authorize this page to open \"web+nextcloudreddit\" links." : "Потім авторизуйте цю сторінку, щоб відкрити посилання \"web+nextcloudreddit\".",
    "If you still don't manage to get the protocol registered, check your settings on this page:" : "Якщо вам все ще не вдається зареєструвати протокол, перевірте свої налаштування на цій сторінці:",
    "With Firefox, you should see a bar on top of this page to authorize this page to open \"web+nextcloudreddit\" links." : "У браузері Firefox ви повинні побачити панель у верхній частині цієї сторінки для авторизації цієї сторінки для відкриття посилань \"web+nextcloudreddit\".",
    "Connect to Reddit" : "Підключіться до Reddit",
    "Connected as {user}" : "Підключено як {user}",
    "Disconnect from Reddit" : "Відключитися від Reddit",
    "You must access this page with HTTPS to be able to authenticate to Reddit." : "Ви повинні отримати доступ до цієї сторінки за допомогою HTTPS, щоб мати змогу авторизуватися на Reddit.",
    "No Reddit account connected" : "Не підключено обліковий запис Reddit",
    "Error connecting to Reddit" : "Помилка підключення до Reddit",
    "No Reddit news!" : "Ніяких новин на Reddit!"
},"pluralForm" :"nplurals=4; plural=(n % 1 == 0 && n % 10 == 1 && n % 100 != 11 ? 0 : n % 1 == 0 && n % 10 >= 2 && n % 10 <= 4 && (n % 100 < 12 || n % 100 > 14) ? 1 : n % 1 == 0 && (n % 10 ==0 || (n % 10 >=5 && n % 10 <=9) || (n % 100 >=11 && n % 100 <=14 )) ? 2: 3);"
}